
## Terraform plan for environment: `dev`

**Commit:** 6cf20b8dfc1ebc9cc7385c0f4c2a694f5319a8ae


**API version:** 802463b33a
**CLI version:** 802463b33a
**Selfserve version:** 802463b33a
**Internal version:** 802463b33a

### Plan summary

`3 to add, 21 to change, 19 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
module.service.aws_cloudwatch_log_group.this["search"]
module.service.aws_lb_target_group.this["search"]
module.service.module.batch.aws_batch_job_definition.this["search"]
module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0]
module.service.module.ecs_cluster["search"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["search"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["search"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["search"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["search"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["search"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["search"].aws_ecs_service.this[0]
module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["search"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["search"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["search"].aws_iam_role.tasks[0]
module.service.module.ecs_service["search"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["search"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["search"].module.container_definition["search"].aws_cloudwatch_log_group.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_caller_identity.current
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["api"].data.aws_partition.current
module.service.module.ecs_service["api"].data.aws_region.current
module.service.module.ecs_service["internal"].data.aws_caller_identity.current
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["internal"].data.aws_partition.current
module.service.module.ecs_service["internal"].data.aws_region.current
module.service.module.ecs_service["selfserve"].data.aws_caller_identity.current
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_partition.current
module.service.module.ecs_service["selfserve"].data.aws_region.current
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
module.service.module.ecs_service["api"].module.container_definition["api"].data.aws_region.current
module.service.module.ecs_service["internal"].module.container_definition["internal"].data.aws_region.current
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].data.aws_region.current
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-dev-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (44 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-dev-liquibase",
                                ],
                              - [
                                  - "AWS/Logs",
                                  - "IncomingLogEvents",
                                  - "LogGroupName",
                                  - "/aws/batch/vol-app-dev-search",
                                ],
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-dev-sas-mi-extract",
                                ],
                                # (3 unchanged elements hidden)
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (43 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-liquibase' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "liquibase-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  - {
                      - height     = 1
                      - properties = {
                          - query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-search' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "search-logs"
                          - view    = "table"
                        }
                      - type       = "log"
                      - width      = 6
                      - x          = 0
                      - y          = 0
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-dev-sas-mi-extract' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "sas-mi-extract-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (3 unchanged elements hidden)
                ]
            }
        )
        id             = "batch-vol-app-dev"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/batch/vol-app-dev-search" -> null
      - id                = "/aws/batch/vol-app-dev-search" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/batch/vol-app-dev-search" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_lb_target_group.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_lb_target_group" "this" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-dev-search-tg/49223d07101d5c0f" -> null
      - arn_suffix                         = "targetgroup/vol-app-dev-search-tg/49223d07101d5c0f" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:054614622558:targetgroup/vol-app-dev-search-tg/49223d07101d5c0f" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "vol-app-dev-search-tg" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-ee79348b" -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 300 -> null
          - matcher             = "200-499" -> null
          - path                = "/healthcheck" -> null
          - port                = "8080" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 60 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:219" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:219"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 219 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:219" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:219"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 219 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:219" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:219"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 219 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:219" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "802463b33a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:219"
        name                       = "vol-app-dev-sas-mi-extract"
      ~ revision                   = 219 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_batch_job_definition" "this" {
      - arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-search:11" -> null
      - arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-search" -> null
      - container_properties       = jsonencode(
            {
              - command                      = []
              - environment                  = [
                  - {
                      - name  = "DB_HOST"
                      - value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                  - {
                      - name  = "DB_NAME"
                      - value = "OLCS_RDS_OLCSDB"
                    },
                  - {
                      - name  = "DB_PORT"
                      - value = "3306"
                    },
                  - {
                      - name  = "DB_USER"
                      - value = "olcssearch"
                    },
                  - {
                      - name  = "ELASTIC_HOST"
                      - value = "searchv6.dev.olcs.dev-dvsacloud.uk"
                    },
                  - {
                      - name  = "LS_JAVA_OPTS"
                      - value = "-Xms8g -Xmx8g"
                    },
                ]
              - executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              - fargatePlatformConfiguration = {
                  - platformVersion = "LATEST"
                }
              - image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/search:latest"
              - jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              - logConfiguration             = {
                  - logDriver     = "awslogs"
                  - options       = {
                      - awslogs-group         = "/aws/batch/vol-app-dev-search"
                      - awslogs-region        = "eu-west-1"
                      - awslogs-stream-prefix = "search"
                    }
                  - secretOptions = []
                }
              - mountPoints                  = []
              - resourceRequirements         = [
                  - {
                      - type  = "VCPU"
                      - value = "1"
                    },
                  - {
                      - type  = "MEMORY"
                      - value = "2048"
                    },
                ]
              - runtimePlatform              = {
                  - cpuArchitecture       = "ARM64"
                  - operatingSystemFamily = "LINUX"
                }
              - secrets                      = [
                  - {
                      - name      = "DB_PASSWORD"
                      - valueFrom = "arn:aws:secretsmanager:eu-west-1:054614622558:secret:DEVAPPDEV-BASE-SM-APPLICATION-API-LYMwJr:olcs_search_rds_password::"
                    },
                ]
              - ulimits                      = []
              - volumes                      = []
            }
        ) -> null
      - deregister_on_new_revision = true -> null
      - id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-search:11" -> null
      - name                       = "vol-app-dev-search" -> null
      - parameters                 = {} -> null
      - platform_capabilities      = [
          - "FARGATE",
        ] -> null
      - propagate_tags             = true -> null
      - revision                   = 11 -> null
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
      - tags_all                   = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
      - type                       = "container" -> null
        # (2 unchanged attributes hidden)

      - retry_strategy {
          - attempts = 1 -> null

          - evaluate_on_exit {
              - action           = "exit" -> null
              - on_exit_code     = "0" -> null
                # (2 unchanged attributes hidden)
            }
          - evaluate_on_exit {
              - action           = "retry" -> null
              - on_exit_code     = "1" -> null
                # (2 unchanged attributes hidden)
            }
        }

      - timeout {
          - attempt_duration_seconds = 300 -> null
        }
    }

  # module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0] will be destroyed
  # (because module.service.module.cloudwatch_log-metric-filter["search"] is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "this" {
      - id             = "search" -> null
      - log_group_name = "/aws/batch/vol-app-dev-search" -> null
      - name           = "search" -> null
      - pattern        = "%ERROR%" -> null

      - metric_transformation {
          - dimensions    = {} -> null
          - name          = "search" -> null
          - namespace     = "vol-app-dev-batch-errors" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.service.module.ecs_cluster["search"].aws_cloudwatch_log_group.this[0] will be destroyed
  # (because module.service.module.ecs_cluster["search"] is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:eu-west-1:054614622558:log-group:/aws/ecs/vol-app-dev-search-cluster" -> null
      - id                = "/aws/ecs/vol-app-dev-search-cluster" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/ecs/vol-app-dev-search-cluster" -> null
      - retention_in_days = 90 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.module.ecs_cluster["search"].aws_ecs_cluster.this[0] will be destroyed
  # (because module.service.module.ecs_cluster["search"] is not in configuration)
  - resource "aws_ecs_cluster" "this" {
      - arn      = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-dev-search-cluster" -> null
      - id       = "arn:aws:ecs:eu-west-1:054614622558:cluster/vol-app-dev-search-cluster" -> null
      - name     = "vol-app-dev-search-cluster" -> null
      - tags     = {} -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - configuration {
          - execute_command_configuration {
              - logging    = "DEFAULT" -> null
                # (1 unchanged attribute hidden)
            }
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # module.service.module.ecs_cluster["search"].aws_iam_policy.task_exec[0] will be destroyed
  # (because module.service.module.ecs_cluster["search"] is not in configuration)
  - resource "aws_iam_policy" "task_exec" {
      - arn              = "arn:aws:iam::054614622558:policy/vol-app-dev-search-cluster-20250502130915463200000002" -> null
      - attachment_count = 1 -> null
      - description      = "Task execution role IAM policy" -> null
      - id               = "arn:aws:iam::054614622558:policy/vol-app-dev-search-cluster-20250502130915463200000002" -> null
      - name             = "vol-app-dev-search-cluster-20250502130915463200000002" -> null
      - name_prefix      = "vol-app-dev-search-cluster-" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "Logs"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ECR"
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:*:*:parameter/*"
                      - Sid      = "GetSSMParams"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      - Sid      = "GetSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAQZN2JAFPAF5BBZ4PC" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
    }

  # module.service.module.ecs_cluster["search"].aws_iam_role.task_exec[0] will be destroyed
  # (because module.service.module.ecs_cluster["search"] is not in configuration)
  - resource "aws_iam_role" "task_exec" {
      - arn                   = "arn:aws:iam::054614622558:role/vol-app-dev-search-cluster-20250502130915456500000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-02T13:09:15Z" -> null
      - description           = "Task execution role for vol-app-dev-search-cluster" -> null
      - force_detach_policies = true -> null
      - id                    = "vol-app-dev-search-cluster-20250502130915456500000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::054614622558:policy/vol-app-dev-search-cluster-20250502130915463200000002",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "vol-app-dev-search-cluster-20250502130915456500000001" -> null
      - name_prefix           = "vol-app-dev-search-cluster-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
      - unique_id             = "AROAQZN2JAFPBBRQVWE5F" -> null
        # (1 unchanged attribute hidden)
    }

  # module.service.module.ecs_cluster["search"].aws_iam_role_policy_attachment.task_exec[0] will be destroyed
  # (because module.service.module.ecs_cluster["search"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "task_exec" {
      - id         = "vol-app-dev-search-cluster-20250502130915456500000001-20250502130915791900000004" -> null
      - policy_arn = "arn:aws:iam::054614622558:policy/vol-app-dev-search-cluster-20250502130915463200000002" -> null
      - role       = "vol-app-dev-search-cluster-20250502130915456500000001" -> null
    }

  # module.service.module.ecs_service["api"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-dev-api-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "task_exec" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Logs"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "ECR"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + resources = [
              + "arn:aws:ssm:*:*:parameter/*",
            ]
          + sid       = "GetSSMParams"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:*:*:secret:*",
            ]
          + sid       = "GetSecrets"
        }
    }

  # module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "ECSTaskExecutionAssumeRole"

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "tasks" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "ECSExec"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:eu-west-1:054614622558:secret:DEVAPPDEV-BASE-SM-APPLICATION-API-LYMwJr",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParametersByPath",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-1:054614622558:parameter/applicationparams/dev/*",
            ]
        }
      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::000081644369:role/txc-int-consumer-role",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:AdminCreateUser",
              + "cognito-idp:AdminDeleteUser",
              + "cognito-idp:AdminDisableUser",
              + "cognito-idp:AdminEnableUser",
              + "cognito-idp:AdminGetUser",
              + "cognito-idp:AdminInitiateAuth",
              + "cognito-idp:AdminResetUserPassword",
              + "cognito-idp:AdminRespondToAuthChallenge",
              + "cognito-idp:AdminSetUserPassword",
              + "cognito-idp:AdminUpdateUserAttributes",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:cognito-idp:eu-west-1:054614622558:userpool/eu-west-1_5ZhcmSfNT",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:DeleteMessageBatch",
              + "sqs:GetQueueAttributes",
              + "sqs:ListDeadLetterSourceQueues",
              + "sqs:PurgeQueue",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET",
              + "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-DLQ",
              + "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-INSOLVENCY",
              + "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-INSOLVENCY-DLQ",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::devapp-olcs-pri-olcs-autotest-s3/*",
            ]
        }
    }

  # module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks_assume[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "tasks_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "ECSTasksAssumeRole"

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.module.ecs_service["api"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.service.module.ecs_service["api"].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-api-cluster/vol-app-dev-api-service"
        name                               = "vol-app-dev-api-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-api-service:312" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-api-service:312" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 2048
                  - environment            = [
                      - {
                          - name  = "APP_VERSION"
                          - value = "802463b33a"
                        },
                      - {
                          - name  = "ELASTICACHE_URL"
                          - value = "tcp://cache.dev.olcs.dev-dvsacloud.uk:6379"
                        },
                      - {
                          - name  = "ENVIRONMENT_NAME"
                          - value = "DEV"
                        },
                    ]
                  - essential              = true
                  - image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:802463b33a"
                  - interactive            = false
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/vol-app-dev-api-service/api"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 100
                  - mountPoints            = []
                  - name                   = "api"
                  - portMappings           = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - name          = "http"
                          - protocol      = "tcp"
                        },
                    ]
                  - privileged             = false
                  - pseudoTerminal         = false
                  - readonlyRootFilesystem = false
                  - startTimeout           = 30
                  - stopTimeout            = 120
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-dev-api-service" -> (known after apply)
      ~ revision                 = 312 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0] will be updated in-place
  ~ resource "aws_iam_policy" "task_exec" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-api-service-20240418150301361200000001"
        name             = "vol-app-dev-api-service-20240418150301361200000001"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "Logs"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ECR"
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:*:*:parameter/*"
                      - Sid      = "GetSSMParams"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      - Sid      = "GetSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.service.module.ecs_service["api"].aws_iam_role.task_exec[0] will be updated in-place
  ~ resource "aws_iam_role" "task_exec" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "vol-app-dev-api-service-20240418150301367500000003"
        name                  = "vol-app-dev-api-service-20240418150301367500000003"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.service.module.ecs_service["api"].aws_iam_role.tasks[0] will be updated in-place
  ~ resource "aws_iam_role" "tasks" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:ecs:eu-west-1:054614622558:*"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "054614622558"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTasksAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "vol-app-dev-api-service-20240418150301374200000005"
        name                  = "vol-app-dev-api-service-20240418150301374200000005"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "tasks" {
        id          = "vol-app-dev-api-service-20240418150301374200000005:vol-app-dev-api-service-20240430142821580100000003"
        name        = "vol-app-dev-api-service-20240430142821580100000003"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ECSExec"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:eu-west-1:054614622558:secret:DEVAPPDEV-BASE-SM-APPLICATION-API-LYMwJr"
                    },
                  - {
                      - Action   = "ssm:GetParametersByPath"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:054614622558:parameter/applicationparams/dev/*"
                    },
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::000081644369:role/txc-int-consumer-role"
                    },
                  - {
                      - Action   = [
                          - "cognito-idp:AdminUpdateUserAttributes",
                          - "cognito-idp:AdminSetUserPassword",
                          - "cognito-idp:AdminRespondToAuthChallenge",
                          - "cognito-idp:AdminResetUserPassword",
                          - "cognito-idp:AdminInitiateAuth",
                          - "cognito-idp:AdminGetUser",
                          - "cognito-idp:AdminEnableUser",
                          - "cognito-idp:AdminDisableUser",
                          - "cognito-idp:AdminDeleteUser",
                          - "cognito-idp:AdminCreateUser",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:eu-west-1:054614622558:userpool/eu-west-1_5ZhcmSfNT"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:PurgeQueue",
                          - "sqs:ListDeadLetterSourceQueues",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessageBatch",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-INSOLVENCY-DLQ",
                          - "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-INSOLVENCY",
                          - "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET-DLQ",
                          - "arn:aws:sqs:eu-west-1:054614622558:DEVAPPDEV-OLCS-PRI-CHGET",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::devapp-olcs-pri-olcs-autotest-s3/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.service.module.ecs_service["internal"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-dev-internal-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "task_exec" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Logs"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "ECR"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + resources = [
              + "arn:aws:ssm:*:*:parameter/*",
            ]
          + sid       = "GetSSMParams"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:*:*:secret:*",
            ]
          + sid       = "GetSecrets"
        }
    }

  # module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec_assume[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "ECSTaskExecutionAssumeRole"

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "tasks" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "ECSExec"
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:eu-west-1:054614622558:secret:DEVAPPDEV-BASE-SM-APPLICATION-INTERNAL-iad1Ax",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParametersByPath",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:eu-west-1:054614622558:parameter/applicationparams/dev/*",
            ]
        }
    }

  # module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks_assume[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "tasks_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "ECSTasksAssumeRole"

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.service.module.ecs_service["internal"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.service.module.ecs_service["internal"].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.service.module.ecs_service["internal"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-internal-cluster/vol-app-dev-internal-service"
        name                               = "vol-app-dev-internal-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-internal-service:202" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-internal-service:202" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-internal-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 2048
                  - environment            = [
                      - {
                          - name  = "APP_VERSION"
                          - value = "802463b33a"
                        },
                      - {
                          - name  = "CDN_URL"
                          - value = "d23zgifomtl7hu.cloudfront.net"
                        },
                      - {
                          - name  = "ELASTICACHE_URL"
                          - value = "tcp://cache.dev.olcs.dev-dvsacloud.uk:6379"
                        },
                      - {
                          - name  = "ENVIRONMENT_NAME"
                          - value = "DEV"
                        },
                    ]
                  - essential              = true
                  - image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/internal:802463b33a"
                  - interactive            = false
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/vol-app-dev-internal-service/internal"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 100
                  - mountPoints            = []
                  - name                   = "internal"
                  - portMappings           = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - name          = "http"
                          - protocol      = "tcp"
                        },
                    ]
                  - privileged             = false
                  - pseudoTerminal         = false
                  - readonlyRootFilesystem = false
                  - startTimeout           = 30
                  - stopTimeout            = 120
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-dev-internal-service" -> (known after apply)
      ~ revision                 = 202 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0] will be updated in-place
  ~ resource "aws_iam_policy" "task_exec" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-internal-service-2024041913242289700000000a"
        name             = "vol-app-dev-internal-service-2024041913242289700000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Al... (truncated, see full plan in the workflow run logs)
```

</details>